Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceDidNotRegenerateProperly Property
 Divided Surface gridlines could not be generated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceDidNotRegenerateProperly { get; }
Public Shared ReadOnly Property DividedSurfaceDidNotRegenerateProperly As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceDidNotRegenerateProperly {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceDidNotRegenerateProperly : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace